# 유저에게
# 첫 번째 정수 입력:
# 두 번째 정수 입력:
# 받은 후 두 수의 합을 출력하는 프로그램
# ex) 첫 번째 정수 입력: 5
#     두 번째 정수 입력: 3
#     결과: 8

# num1 = input("첫 번째 정수 입력:")
# num2 = input("두 번째 정수 입력:")
# result = int(num1)+int(num2)
# print(f"결과:{result}")

# 사용자의 나이를 입력받아, 그 사람이 태어난 연도를 계산하여 출력하는 프로그램을 작성해보세요."
 #예시: 나이가 20살이라면, 출생년도는 2003년입니다.

# age = input("현재 본인의 나이를 입력해주세요")
# result = 2024 - int(age) + 1
# print(f"나이가 {age}살 이라면, 출생년도는 {result}년 입니다.")

#한 변의 길이를 입력받아, 정사각형의 넓이를 구하는 프로그램을 만들어보세요
#(side변 길이),(width넓이)
# len = input("정사각형의 한 변의 길이는?")
# #result = int(len)^2
# result = int(len)*int(len)
# print(f"한 변의 길이가 {len}이라면, 넓이는 {result} 입니다.")





